package com.example.springbootinit.manager;

import org.junit.jupiter.api.Test;
import org.springframework.boot.test.context.SpringBootTest;

import javax.annotation.Resource;

@SpringBootTest
class RedisLimiterManagerTest {

    @Resource
    private RedisLimiterManager redisLimiterManager;

    @Test
    void doRateLimit() throws InterruptedException {
        String userId = "1";
        for (int i = 0; i < 2; i++) {
            redisLimiterManager.doRateLimit(userId);
            System.out.println("成功");
        }
        Thread.sleep(1000);
        for (int i = 0; i < 5; i++) {
            redisLimiterManager.doRateLimit(userId);
            System.out.println("成功");
        }
    }
    @Test

    public static void main(String[] args) {
            String inputString = "回答：【【【【\n" +
                    "{\n" +
                    "  \"xAxis\": {\n" +
                    "    \"type\": \"category\",\n" +
                    "    \"data\": [\"156.120513\",\"228.410653\",\"259.3497982\",\"153.9918677\",\"250.7150242\",\"271.8422993\",\"190.9369279\",\"158.607676\",\"283.8240221\",\"119.7099462\",\"263.271829\",\"197.5138145\",\"146.0017001\",\"215.1235139\",\"292.5641966\",\"238.2605687\",\"152.6789913\",\"295.9259026\",\"252.7007332\",\"190.8070232\"]\n" +
                    "  },\n" +
                    "  \"yAxis\": {\n" +
                    "    \"type\": \"value\"\n" +
                    "  },\n" +
                    "  \"series\": [\n" +
                    "    {\n" +
                    "      \"name\": \"温度\",\n" +
                    "      \"type\": \"line\",\n" +
                    "      \"data\": [49.0359909,78.93779585,96.20201531,55.71350553,96.68278145,82.3474076,80.24110691,46.15749881,49.9805111,22.23446226,58.15694861,23.27749894,81.99800294,57.11376713,49.48340361,26.23955808,92.69295038,95.50652753,70.87476354,47.13110293]\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"name\": \"压力\",\n" +
                    "      \"type\": \"line\",\n" +
                    "      \"data\": [389.0670527,244.0282938,274.9953614,325.204909,412.4663196,459.6964461,386.0835072,420.1930263,366.2725716,263.3632314,287.4216384,277.7839105,421.83614,326.0335169,247.3800504,356.7735718,null,null,null,null]\n" +
                    "    }\n" +
                    "  ]\n" +
                    "}\n" +
                    "】】】】\n" +
                    "分析结论：从折线图中可以看出，随着温度的升高，产率呈现出先上升后下降的趋势。在温度为 156、 和  时，产率较高，分别为  和 。而当温度达到  时，产率下降到最低点。与此同时，压力对产率的影响较小，整体上呈现出波动性变化。\n" +
                    "\n" +
                    "提问tokens：909，回答tokens：869，总消耗tokens：1778\n" +
                    "【【【【\n" +
                    "{\n" +
                    "  \"xAxis\": {\n" +
                    "    \"type\": \"category\",\n" +
                    "    \"data\": [\"156.120513\",\"228.410653\",\"259.3497982\",\"153.9918677\",\"250.7150242\",\"271.8422993\",\"190.9369279\",\"158.607676\",\"283.8240221\",\"119.7099462\",\"263.271829\",\"197.5138145\",\"146.0017001\",\"215.1235139\",\"292.5641966\",\"238.2605687\",\"152.6789913\",\"295.9259026\",\"252.7007332\",\"190.8070232\"]\n" +
                    "  },\n" +
                    "  \"yAxis\": {\n" +
                    "    \"type\": \"value\"\n" +
                    "  },\n" +
                    "  \"series\": [\n" +
                    "    {\n" +
                    "      \"name\": \"温度\",\n" +
                    "      \"type\": \"line\",\n" +
                    "      \"data\": [49.0359909,78.93779585,96.20201531,55.71350553,96.68278145,82.3474076,80.24110691,46.15749881,49.9805111,22.23446226,58.15694861,23.27749894,81.99800294,57.11376713,49.48340361,26.23955808,92.69295038,95.50652753,70.87476354,47.13110293]\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"name\": \"压力\",\n" +
                    "      \"type\": \"line\",\n" +
                    "      \"data\": [389.0670527,244.0282938,274.9953614,325.204909,412.4663196,459.6964461,386.0835072,420.1930263,366.2725716,263.3632314,287.4216384,277.7839105,421.83614,326.0335169,247.3800504,356.7735718,null,null,null,null]\n" +
                    "    }\n" +
                    "  ]\n" +
                    "}\n" +
                    "】】】】\n" +
                    "分析结论：从折线图中可以看出，随着温度的升高，产率呈现出先上升后下降的趋势。在温度为 156、 和  时，产率较高，分别为  和 。而当温度达到  时，产率下降到最低点。与此同时，压力对产率的影响较小，整体上呈现出波动性变化";

            // 使用正则表达式进行分割
            String[] splits = inputString.split("【【【【|】】】】");

            // 输出分割后的结果
//            for (String part : splits) {
////                System.out.println(part+"\n"+"****");
//            }
            String genChart = splits[1].trim();
            System.out.println(genChart);
            String genResult = splits[2].trim();
            System.out.println(genResult );
        }

}